#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

int main()
{
	int n = 9;
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);	//9
	//n的值没有被改变，所以还是9

	printf("*pFloat的值为：%f\n", *pFloat);	//0.000000
	//整型9在内存中的补码：00000000 00000000 00000000 00001001
	//*pFloat是一个单精度浮点型，以浮点型的方式取出9：
	//0 00000000 00000000000000000001001
	//S=0, E=00000000, M=0000000000000000001001
	//可见E为全0，按照前面讲的规则，E的真实值=1-127=-126，M的真实值=0.00000000000000000001001
	//套用前面的公式：(-1)^0 * 0.00000000000000000001001 * 2^-126
	//显然，这是一个非常小的数字，而打印时只能打印出小数点后6位，所以是0.000000

	*pFloat = 9.0;
	printf("n的值为：%d\n", n);	//1091567616
	//n的值通过*pFloat指针被重新赋为浮点型的9.0
	//9.0直接转为二进制 -> 1001.0，按规则把小数点提前3位 -> 1.001 * 2^3，
	//且9.0是正数，最终转换为：(-1)^0 * 1.001 * 2^3
	//S=0, E=3+127=130, M=1.001
	//那么，第一位的符号位S=0，指数E=3+127=130，写成二进制形式：10000010，有效数字M=001，后面补20个0凑满23位
	//所以，写成二进制形式应该是S+E+M，即：
	//0 10000010 00100000000000000000000000
	//把这个二进制数字转换为十进制正是1091567616

	printf("*pFloat的值为：%f\n", *pFloat);	//9.000000
	//浮点数以%f直接取出就是9.000000
	return 0;
}